"use strict"
let $ = document;

let containerBox = $.querySelector('.container')

let products = [
    { id: 1, name: 'چرم مردانه', img: '/images/1.jpg', price: 65, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 2, name: 'اسپرت مردانه', img: '/images/2.jpg', price: 35, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 3, name: 'ا سیکس ', img: '/images/3.jpg', price: 95, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 4, name: 'چرم مردانه', img: '/images/4.jpg', price: 65, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد' },
    { id: 5, name: 'چرم زنانه', img: '/images/5.jpg', price: 55, description: ' شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 6, name: 'چرم مردانه', img: '/images/6.jpg', price: 43, description: ' شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 7, name: 'اسپرت مردانه', img: '/images/7.jpg', price: 33, description: ' شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 8, name: 'اسپرت مردانه', img: '/images/8.jpg', price: 25, description: ' شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 9, name: 'اسپرت مردانه', img: '/images/9.jpg', price: 85, description: ' شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 10, name: 'کفش زنانه', img: '/images/10.jpg', price: 69, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 11, name: 'کفش زنانه', img: '/images/11.jpg', price: 25, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 12, name: 'کفش زنانه', img: '/images/12.jpg', price: 26, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 13, name: 'کفش زنانه', img: '/images/13.jpg', price: 78, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 14, name: 'کفش بچگانه', img: '/images/14.jpg', price: 32, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 15, name: 'کفش بچگانه', img: '/images/15.jpg', price: 56, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
    { id: 16, name: 'کفش بچگانه', img: '/images/16.jpg', price: 65, description: 'شما به راحتی می‌توانید با برانداز کردن کفش، از قسمت بالای کفش، رویه، زیره کفی، زبانه و هر سوراخ و بند کفش، به کیفیت آن پی ببرید. بنابراین عجله نکنید، به خوبی تمام جزئیات کفش را بررسی کنید تا مطمئن شوید جنس مناسبی را انتخاب کردید. کفش شل و ول، جنس بادوامی ندارد و احتمالا بعد از مدت کوتاهی پایتان را اذیت کند و از قیافه بیفتد.' },
]

products.forEach(product => {
    containerBox.insertAdjacentHTML('beforeend', `
    <div class="product-card">
    <h1>${product.name}</h1>
    <p>${product.description}</p>
    <div class="product-pic" style="background-image: url(${product.img});"></div>
    <div class="product-info">
        <div class="product-price">${product.price} $</div>
        <a href="product.html?id=${product.id}" onclick="log(${product.id})" class="product-button">مشاهده بیشتر</a>
    </div>
    </div>`)
})

